In [1]:
import pandas as pd
import sqlite3
tmpdb = sqlite3.connect('tmp6.db')
%load_ext sql
%sql sqlite:///tmp6.db
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [2]:
%%sql

CREATE TABLE IF NOT EXISTS nomnom (
  NAME TEXT,
  NEIGHBOURHOOD TEXT,
  CUISINE TEXT,
  REVIEW REAL,
  PRICE TEXT,
  HEALTH TEXT
);

 * sqlite:///tmp6.db
Done.

[]

In [3]:
%%sql

INSERT INTO nomnom (NAME, NEIGHBOURHOOD, CUISINE, REVIEW, PRICE, HEALTH) VALUES
  ('Peter', 'Brooklyn', 'Steak', 4.4, '$$$$', 'A'),
  ('Jongro', 'Midtown', 'Korean', 3.5, '$$', 'A'),
  ('Pocha', 'Midtown', 'Pizza', 4, '$$$', 'B'),
  ('Lighthouse', 'Queens', 'Chinese', 3.9, '$', 'A'),
  ('Minca', 'Downtown', 'American', 4.6, '$$$', ''),
  ('Marea', 'Chinatown', 'Chinese', 3.0, '$$', ''),
  ('Dirty Candy', 'Uptown', 'Italian', 4.9, '$$$$', 'B'),
  ('Di Fara Pizza', 'Brooklyn', 'Pizza', 3.8, '$$$', 'A'),
  ('Golden Unicorn', 'Uptown', 'Italian', 3.8, '$$', 'A');

 * sqlite:///tmp6.db
9 rows affected.

[]

In [4]:
%%sql

SELECT * FROM nomnom;

 * sqlite:///tmp6.db
Done.

[('Peter', 'Brooklyn', 'Steak', 4.4, '$$$$', 'A'),
 ('Jongro', 'Midtown', 'Korean', 3.5, '$$', 'A'),
 ('Pocha', 'Midtown', 'Pizza', 4.0, '$$$', 'B'),
 ('Lighthouse', 'Queens', 'Chinese', 3.9, '$', 'A'),
 ('Minca', 'Downtown', 'American', 4.6, '$$$', ''),
 ('Marea', 'Chinatown', 'Chinese', 3.0, '$$', ''),
 ('Dirty Candy', 'Uptown', 'Italian', 4.9, '$$$$', 'B'),
 ('Di Fara Pizza', 'Brooklyn', 'Pizza', 3.8, '$$$', 'A'),
 ('Golden Unicorn', 'Uptown', 'Italian', 3.8, '$$', 'A')]

In [5]:
%%sql
SELECT DISTINCT NEIGHBOURHOOD FROM nomnom;

 * sqlite:///tmp6.db
Done.

[('Brooklyn',),
 ('Midtown',),
 ('Queens',),
 ('Downtown',),
 ('Chinatown',),
 ('Uptown',)]

In [7]:
%%sql
SELECT DISTINCT CUISINE FROM nomnom;

 * sqlite:///tmp6.db
Done.

[('Steak',),
 ('Korean',),
 ('Pizza',),
 ('Chinese',),
 ('American',),
 ('Italian',)]

In [8]:
%%sql
SELECT * FROM nomnom WHERE CUISINE = 'Chinese';

 * sqlite:///tmp6.db
Done.

[('Lighthouse', 'Queens', 'Chinese', 3.9, '$', 'A'),
 ('Marea', 'Chinatown', 'Chinese', 3.0, '$$', '')]

In [9]:
%%sql
SELECT * FROM nomnom WHERE REVIEW >= 4;

 * sqlite:///tmp6.db
Done.

[('Peter', 'Brooklyn', 'Steak', 4.4, '$$$$', 'A'),
 ('Pocha', 'Midtown', 'Pizza', 4.0, '$$$', 'B'),
 ('Minca', 'Downtown', 'American', 4.6, '$$$', ''),
 ('Dirty Candy', 'Uptown', 'Italian', 4.9, '$$$$', 'B')]

In [10]:
%%sql
SELECT * FROM nomnom WHERE CUISINE = 'Italian' AND PRICE = '$$$';

 * sqlite:///tmp6.db
Done.

[]

In [11]:
%%sql
SELECT * FROM nomnom WHERE NAME LIKE '%Candy%';

 * sqlite:///tmp6.db
Done.

[('Dirty Candy', 'Uptown', 'Italian', 4.9, '$$$$', 'B')]

In [12]:
%%sql
SELECT * FROM nomnom 
WHERE NEIGHBOURHOOD IN ('Midtown', 'Downtown', 'Chinatown');

 * sqlite:///tmp6.db
Done.

[('Jongro', 'Midtown', 'Korean', 3.5, '$$', 'A'),
 ('Pocha', 'Midtown', 'Pizza', 4.0, '$$$', 'B'),
 ('Minca', 'Downtown', 'American', 4.6, '$$$', ''),
 ('Marea', 'Chinatown', 'Chinese', 3.0, '$$', '')]

In [13]:
%%sql
SELECT * FROM nomnom ORDER BY REVIEW DESC LIMIT 4;

 * sqlite:///tmp6.db
Done.

[('Dirty Candy', 'Uptown', 'Italian', 4.9, '$$$$', 'B'),
 ('Minca', 'Downtown', 'American', 4.6, '$$$', ''),
 ('Peter', 'Brooklyn', 'Steak', 4.4, '$$$$', 'A'),
 ('Pocha', 'Midtown', 'Pizza', 4.0, '$$$', 'B')]